import sys
import os
import unittest

# 確保 Python 可以找到 refine_description 模組
sys.path.insert(0, os.path.abspath(os.path.join(os.path.dirname(__file__), "..")))

from refine_description.refine_description import app
from fastapi.testclient import TestClient


class TestRefineDescription(unittest.TestCase):
    def setUp(self):
        self.client = TestClient(app)

        self.test_products = [
            {
                "id": 9823,
                "uri": "https://fashionforyes168.shoplineapp.com/products/終生推薦24hrs無感面膜內褲-淚推款-1",
                "price": 680.0,
                "title": "終生推薦24HRS無感面膜內褲三色組  (淚推款)",
                "status": 0,
                "vender": 0,
                "vendor": "shopline",
                "summary": "▪️ 現貨約 7 - 14 個工作天【不含例假日】出貨\n▪️ 預購時間約 10 - 21 個工作天【不含例假日】\n▪️ 內褲皆為獨立包裝\n▪️ 內褲因衛生考量，不提供退換貨服務\n▪️ 拆封包裹時需全程錄影，若有問題需私訊Facebook粉專，無提供影片恕不受理\n▪️ 深色內褲請勿與淺色內褲一同清洗，若因此有染色問題恕不受理",
                "brand_id": 75,
                "media_url": "https://img.shoplineapp.com/media/image_clips/672d82a18aeae4000f461a06/original.jpg?1731035809",
                "categories": [
                    "無痕內著",
                    "24HRS新客頁",
                    "滑順貼合 #無痕內著",
                    "24HRS 無感系列",
                    "新品銷售冠軍",
                    "🩲內褲𝟴件𝟴𝟴𝟴❣️",
                    "有蛇財有得",
                    "中高腰",
                    "· 女內褲",
                ],
                "created_at": "2024-11-20 20:23:45.794925",
                "price_sale": 380.0,
                "updated_at": "2025-02-04 02:02:58.240218",
                "external_id": "6703baa5dca276000ca81116",
                "document_source": "api",
                "zendesk_customer_id": 28,
                "description": "['無痕內著', '24HRS新客頁', '滑順貼合 #無痕內著', '24HRS 無感系列', '新品銷售冠軍', '🩲內褲𝟴件𝟴𝟴𝟴❣️', '有蛇財有得', '中高腰', '· 女內褲']\n終生推薦24HRS無感面膜內褲三色組  (淚推款)\n🛒 終生推薦24HRS無感面膜內褲 (淚推款)顏色：湖水綠/經典黑/香檳白尺寸：Free size 價格：三入一組$380兩組700 十組3000 三十組8400✨極致超彈，無拘無束能拉伸至2.0倍，無論你的身材如何（XS~XXL），無論你怎麼動，都會完美貼合，讓你完全忘記它的存在。✨如無物般的裸感體驗我們的內褲採用超柔軟、透氣、親膚的面料，讓你瞬間感受到前所未有的裸感享受，就像沒穿過內褲一樣輕盈自在。✨7A級超強抗菌，清新一整天採用先進抗菌技術的面料，讓你時刻保持潔淨清爽✨薄如蟬翼，輕如鴻毛薄到你幾乎感覺不到它的存在，僅0.2cm厚、110g重，這樣輕盈的內褲完全告別尷尬的內褲痕跡✨絕對不卡臀，不再有尷尬特殊版型設計告別一切卡臀煩惱，讓你怎麼動都安心自在，無需擔心走位。✨適合每位女性的內褲首選不論你是20歲還是70歲，這款內褲都會成為你的心頭愛。超過150位試穿員和他們的媽媽們一致認為：這是她們穿過最舒適的內褲！----------------------------------------------------------------------------🔺注意事項🔺內褲統一建議手洗清潔 清潔時請使用冷水搭配溫和中性洗劑搓洗即可深淺色務必分開洗滌，勿相互疊放與浸泡，避免染色洗滌時請勿使用尖銳工具刷洗，以免造成破損▸ 產地：中國【下單前必看】1. 確認下單後無法任意取消訂單與更改尺寸及數量 請見諒2. 如對商品有任何疑慮  歡迎下單前多加利用粉絲專頁訊息詢問#內褲因衛生考量，不提供退換貨服務【貼心告知】商品售價已含5%營業稅支持開立發票合法商家\n經典黑/湖水綠/香檳白超級彈力不緊繃 裸感包覆 面料親膚透氣柔軟細膩 超強抗菌7A抗菌 極致輕薄厚度是110G 0.2cm 不露尷尬內褲痕 絕對不卡臀 面料高彈力 舒適自由無勒感 彈力拉升高達2.0倍",
            },
            {
                "id": 15178,
                "uri": "https://fashionforyes168.shoplineapp.com/products/o039772-5-2-1-7-1-1-2-2",
                "price": 680.0,
                "title": "(皖暈專區)視覺引爆24HRS無感集中內衣(美胸款)",
                "status": 0,
                "vender": 3,
                "vendor": "shopline",
                "summary": "▪️ 由於近期倉庫爆單，導致出貨量激增，現貨需要等待約 5 - 10 個工作天【不含例假日】出貨\n▪️ 預購時間約 14 - 28 個工作天【不含例假日】\n▪️ 美胸為盒裝出貨，體積較大緣故不提供超取服務，如訂單內有美胸款請使用宅配\n▪️ 內褲因衛生考量，不提供退換貨服務\n▪️ 拆封包裹時需全程錄影，若有問題需私訊Facebook粉專，無提供影片恕不受理\n▪️ 深色內衣請勿與淺色內衣一同清洗，若因此有染色問題恕不受理",
                "brand_id": 75,
                "media_url": "https://img.shoplineapp.com/media/image_clips/674fcc4613059e000ab5062d/original.jpg?1733282885",
                "categories": ["皖暈團購專區02"],
                "created_at": "2024-12-27 08:55:06.258110",
                "price_sale": 460.0,
                "updated_at": "2024-12-27 08:55:06.258110",
                "external_id": "676e6a26f97b4b000e0a3596",
                "document_source": "api",
                "zendesk_customer_id": 28,
                "description": "['皖暈團購專區02']\n(皖暈專區)視覺引爆24HRS無感集中內衣(美胸款)\n美胸為盒裝出貨，體積較大緣故不提供超取服務，如訂單內有美胸款請使用宅配因美胸款胸墊較厚，運輸中遭受擠壓易產生摺痕，團購分裝務必箱裝出貨，如因分裝未使用盒裝寄出造成商品毀損，恕不接受售後小胸女孩的天菜!!!! 平地起高樓🤫無中生有的終極秘密！視覺引爆24HRS無感集中內衣(美胸款) #所有女性超強作弊神器 穿後心得絕對是：穿著很無感 爆乳很有感🔥🪄平地起高樓，自然集中 採用先進的果凍刮膠+超聲波工藝，這款內衣能完美塑造自然的聚攏胸型，讓小胸女孩也能自信地展現美麗曲線。🪄無痕高彈面料，極致舒適高彈力無痕面料緊貼肌膚，無束縛感，無論怎麼動都舒適自如，告別以往爆乳內衣的壓迫感。🪄3D立體杯設計，上薄下厚，強力上托這款內衣的3D立體杯設計，能夠強力上托防止下垂，同時提供反重力支撐，讓你的胸型更加立體、曲線更加迷人。🪄自然集中，視覺爆乳通過專業設計，自然集中效果讓胸部曲線更迷人，即使小胸也能擁有豐滿效果，視覺上讓你瞬間“升級”！🪄拒絕空杯，完美貼合無論你的胸型如何，這款內衣都能夠完美貼合，拒絕空杯，提供全天候的自信支持。🪄美背設計，穿法多樣可後拆卸交叉肩帶設計，既可以打造優雅美背，又可以根據不同需求自由調整，讓你輕鬆應對各種穿搭風格。🙋‍♀️如果你是追求自然胸型罩杯升級的所有小胸女孩，這款視覺引爆24HRS無感集中內衣絕對是你的必備作弊神器💯無論你是想要在穿衣時展現完美曲線，還是追求全天候的舒適感受，這款內衣都能滿足你的需求。----------🔺美胸款無內褲🔺----------🔺注意事項🔺◆ 內衣.褲統一建議單獨手洗清潔 ◆  清潔時請使用冷水搭配溫和中性洗劑洗滌即可◆  深淺色務必分開洗滌，勿相互疊放與浸泡，避免染色◆  洗滌時請勿使用尖銳工具刷洗，以免造成破損◆  請避免使用烘衣機，可能會因熱造成變形、縮水、破損等問題▸ 產地：中國【下單前必看】1. 確認下單後無法任意取消訂單與更改尺寸及數量 請見諒2. 如對商品有任何疑慮  歡迎下單前多加利用粉絲專頁訊息詢問#24小時內衣無感保證 不舒服7天內無條件退貨品質和服務的自信決定我們的承諾的堅定內褲因衛生考量，不提供退換貨服務【貼心告知】商品售價已含5%營業稅支持開立發票合法商家\n▸ 產地：中國 【下單前必看】 1. 確認下單後無法任意取消訂單與更改尺寸及數量 請見諒 2. 如對商品有任何疑慮  歡迎下單前多加利用粉絲專頁訊息詢問 #24小時內衣無感保證 不舒服7天內無條件退貨 內褲因衛生考量，不提供退換貨服務 品質和服務的自信 決定我們的承諾的堅定 【貼心告知】 商品售價已含5%營業稅支持開立發票合法商家",
            },
        ]

    def test_summarize_product_descriptions(self):
        """測試：使用測試商品範例資料，檢查 API 回應是否正常"""
        for product in self.test_products:
            response = self.client.post(
                "/summarized-description", json={"description": product["description"]}
            )
            self.assertEqual(response.status_code, 200)
            json_response = response.json()

            self.assertIn("summarized_description", json_response)
            self.assertNotEqual(json_response["summarized_description"], "")

            print(f"{json_response['summarized_description']}")


if __name__ == "__main__":
    unittest.main()
